app/controllers/brand_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`brand_id` IS NULL
---
  def new
    # binding.pry
    @invitations = []
    @user = User.all.where(:brand_id => nil)

SELECT  `brands`.* FROM `brands` WHERE `brands`.`name` = 'final' LIMIT 1
SELECT COUNT(*) FROM `brands` WHERE `brands`.`name` = 'hello'
INSERT INTO `brands` (`name`, `created_at`, `updated_at`) VALUES ('hello', '2017-02-10 11:43:49', '2017-02-10 11:43:49')
UPDATE `users` SET `brand_id` = 2, `updated_at` = '2017-02-10 11:11:24' WHERE `users`.`id` = 9
---
  def create
    brand = Brand.where(:name => params["brand_name"])
    if brand.count == 0
      brand = Brand.create(:name => params["brand_name"])
      current_user.brand = brand
      current_user.save