app/controllers/invitation_controller.rb

  def edit
    invite  = current_user.inverse_invitations.find(params[:id])
    if invite.nil?
      flash[:notice] = "Wrong Invite"
      redirect_to new_brand_path
    else
      current_user.inverse_invitations.update_all(:status => "rejected")
      invite.update_attributes(:status => "accepted")
      Invitation.find(invite).histories.create(:action => 'accepted', :user_id => current_user.id, :notify => false)
---
SELECT  `invitations`.* FROM `invitations` WHERE `invitations`.`id` = 27 LIMIT 1
UPDATE `invitations` SET `status` = 'accepted', `updated_at` = '2017-02-10 13:09:17' WHERE `invitations`.`id` = 10
UPDATE `users` SET `brand_id` = 1, `updated_at` = '2017-02-10 13:09:17' WHERE `users`.`id` = 9
INSERT INTO `histories` (`link_type`, `link_id`, `user_id`, `action`, `notify`, `created_at`, `updated_at`) VALUES ('Invitation', 27, 39, 'accepted', 0, '2017-02-13 13:46:33', '2017-02-13 13:46:33')