app/controllers/projects_controller.rb

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 68 LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `projects_users` ON `users`.`id` = `projects_users`.`user_id` WHERE `projects_users`.`project_id` = 68
---
  def members
  	    @members = Project.find_by(:id => params['projectname']['id']).users

SELECT `projects`.* FROM `projects` INNER JOIN `projects_users` ON `projects`.`id` = `projects_users`.`project_id` WHERE `projects_users`.`user_id` = 27
---
  def get
        @projects = current_user.projects.all

INSERT INTO `tasks` (`name`, `git_status`, `backlog_count`, `created_at`, `updated_at`, `project_id`, `assigned_id`, `taken`, `completed`) VALUES (' sachin', 0, 0, '2017-02-24 12:30:56', '2017-02-24 12:30:56', 75, 27, 0, 0)
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 68 LIMIT 1
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 170 LIMIT 1
INSERT INTO `histories` (`link_type`, `link_id`, `user_id`, `action`, `notify`, `created_at`, `updated_at`) VALUES ('Task', 170, 45, 'task added', 0, '2017-02-27 13:22:25', '2017-02-27 13:22:25')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 27 ORDER BY `users`.`id` ASC LIMIT 1
---
  def add_task_queue
       project = Project.find(params['currentProject']['id']).tasks.create(:name => params['task'],:project_id => params['currentProject']['id'],:git_status => false,:backlog_count => 0,:assigned_id => current_user.id,:taken => false, :completed => false)
       Task.find(project).histories.create(:action => "task added", :user_id => current_user.id, :notify => false)
        params[:assignedToDetails].each do |detail|
          project.users << User.find(params[:assignedToDetails][detail]['id'])