app/controllers/projects_controller.rb

SELECT `proinvites`.* FROM `proinvites` WHERE `proinvites`.`email` = 'first@code.com' AND `proinvites`.`status` = 0
---
  def index
      Proinvite.where(:email => current_user.email,:status => false).each do |i|

INSERT INTO `projects` (`name`, `created_at`, `updated_at`, `brand_id`, `admin_id`, `hook`) VALUES ('sl', '2017-02-24 11:31:39', '2017-02-24 11:31:39', 13, 27, 'https://hooks.slack.com/services/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')
---
  def create
    ProjectService.new.create_project(params,current_user)

INSERT INTO `projects` (`name`, `created_at`, `updated_at`, `brand_id`, `admin_id`, `hook`) VALUES ('slack', '2017-02-24 11:31:06', '2017-02-24 11:31:06', 13, 27, 'https://hooks.slack.com/services/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')
---
  def get
        @projects,@addMembers,@user = ProjectService.new.create_project_details(current_user)

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`project_id` IS NULL AND `tasks`.`taken` = 0
---
  def update_task_queue
    task_queue = Task.where(:project_id => params['currentProject']['id'], :taken => false)

SELECT `tasks`.`estimated_time` FROM `tasks` INNER JOIN `tasks_users` ON `tasks`.`id` = `tasks_users`.`task_id` WHERE `tasks_users`.`user_id` = 29 AND `tasks`.`project_id` = 75 AND `tasks`.`taken` = 1
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 152 LIMIT 1
---
  def take_task
    estimated_time = current_user.tasks.where(:project_id => params['currentProject']['id'],:taken => true).pluck(:estimated_time)
    estimated_time << params['estimated_time'].to_i
    if estimated_time.sum < 12

SELECT `tasks`.`estimated_time` FROM `tasks` INNER JOIN `tasks_users` ON `tasks`.`id` = `tasks_users`.`task_id` WHERE `tasks_users`.`user_id` = 27 AND `tasks`.`project_id` IS NULL AND `tasks`.`taken` = 1
SELECT `tasks`.`completed_time` FROM `tasks` INNER JOIN `tasks_users` ON `tasks`.`id` = `tasks_users`.`task_id` WHERE `tasks_users`.`user_id` = 27 AND `tasks`.`project_id` = 68 AND `tasks`.`completed` = 1
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` IS NULL LIMIT 1
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`project_id` IS NULL AND `tasks`.`taken` = 0
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`project_id` IS NULL AND `tasks`.`completed` = 1
---
  def update_time
    estimated_time = current_user.tasks.where(:project_id => params['currentProject']['id'],:taken => true).pluck(:estimated_time)
    completed_time = current_user.tasks.where(:project_id => params['currentProject']['id'],:completed => true).pluck(:completed_time)
    estimated_time = estimated_time.sum
    completed_time = completed_time.sum

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 151 LIMIT 1
UPDATE `tasks` SET `completed` = 1, `completed_time` = 2, `updated_at` = '2017-02-24 12:41:22' WHERE `tasks`.`id` = 151
---
  def completed
     Task.find(params['task_id']).update(:completed => true, :completed_time => params['completed_time'])

DELETE FROM `tasks` WHERE `tasks`.`id` = 150
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 144 LIMIT 1
---
  def delete_task
    Task.find(params['task_id']).destroy

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 156 LIMIT 1
---
  def back_to_add_tasks
        Task.find(params['task_id']).update(:taken => false,:day => nil, :estimated_time => nil)

DELETE FROM `projects` WHERE `projects`.`id` = 73
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 71 LIMIT 1
---
  def delete_project
    Project.find(params['project_id']).destroy

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 68 LIMIT 1
---
  def call_edit
    name = Project.find(params['currentProject']['id']).name

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 68 LIMIT 1
UPDATE `projects` SET `hook` = 'https://hooks.slack.com/services/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', `updated_at` = '2017-02-27 07:50:04' WHERE `projects`.`id` = 69
---
  def edit_project
   project = Project.find(params['currentProject']['id']).update(:name => params['projectname'], :hook => params['hook'])