app/controllers/registrations_controller.rb

  def create
      #Check whether user is already present in table
      if User.where(:email => params['user']['email']).present?
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'bottle@code.com'