app/controllers/registrations_controller.rb

INSERT INTO `histories` (`link_type`, `link_id`, `user_id`, `action`, `notify`, `created_at`, `updated_at`) VALUES ('user', 29, 29, 'signed up', 0, '2017-02-13 12:07:23', '2017-02-13 12:07:23')
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `username`, `firstname`, `lastname`) VALUES ('firstname@gmail.com', '$2a$11$we7M6MWOaSeP3KDUcGHXTOhiZS38X2wNTxu4.n583lqBJg3TTs25m', '2017-02-13 08:21:31', '2017-02-13 08:21:31', 'username', 'firstname', 'lastname')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 13 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `invites`.* FROM `invites` WHERE `invites`.`email` = 'saravanan@gmail.com' AND `invites`.`status` = 0
INSERT INTO `invitations` (`brand_id`, `user_id`, `created_at`, `updated_at`, `status`, `invitee_id`) VALUES (12, 14, '2017-02-13 08:36:20', '2017-02-13 08:36:20', 'pending', 18)
UPDATE `invites` SET `status` = 1, `updated_at` = '2017-02-13 08:36:20' WHERE `invites`.`id` = 1
UPDATE `users` SET `sign_in_count` = 1, `current_sign_in_at` = '2017-02-13 13:01:12', `last_sign_in_at` = '2017-02-13 13:01:12', `current_sign_in_ip` = '127.0.0.1', `last_sign_in_ip` = '127.0.0.1', `updated_at` = '2017-02-13 13:01:12' WHERE `users`.`id` = 33
---
  def create
      super
      User.find(current_user.id).histories.create(:user_id => current_user.id, :action => 'signed up', :notify => false)
        Invite.where(:email => params[:user][:email]).where(:status => false).each do |invite|
      	invitation = Invitation.create(:brand_id => invite.brand_id, :user_id => invite.user_id, :invitee_id => current_user.id, :status => 'pending')
      	invite.update_attributes(:status => true)